[
    {
        "date": "9/2025",
        "text": "I have started a new position as an Assistant Professor in the University of Washington Information School. Come say hi!"
    },
    {
        "date": "5/2025",
        "text": "I successfully defended my dissertation, 'The Atomization of Vulnerability: An Ethnographic Investigation of Quantification and Automation in Philadelphia’s Homeless Services Coordinated Entry System.' Many thanks to my wonderful committee :)"
    },
    {
        "date": "11/2024",
        "text": "Ben Zhang and I presented a paper at AoIR, on Waiting and the technopolitics of AI"
    },
    {
        "date": "10/2024",
        "text": "I was invited to a fantastic panel on Ethnographic Stories in Information Science at ASIS&T. Many thanks to Kaitlin Montague for the invitation!"
    },
    {
        "date": "07/2024",
        "text": "New paper accepted at CSCW 2024, 'Intermediation: Algorithmic Prioritization in Practice in Homeless Services'"
    },
    {
        "date": "07/2024",
        "text": "I presented part of my dissertation work, a paper on 'Intermediation', at 4S in Amsterdam"
    },
    {
        "date": "04/2024",
        "text": "New paper accepted in Big Data & Society, 'Reparations of the Horse?: Algorithmic Reparations and Overspecialized Remedies'. My co-authors and I present a new framework for classifying and repairing algorithmic harms"
    }, 
    {
        "date": "02/2024",
        "text": "New paper out in Big Data & Society 'After automation: Homelessness prioritization algorithms and the future of care labor'"
    },
    {
        "date": "12/2023",
        "text": "I'll be interning with the Government Accountability Office in DC this Spring!"
    },
    {
        "date": "11/2023",
        "text": "I presented a paper, 'Toward a Theory of Low Tech Algorithms,' at the 4S (Society for the Social Studies of Science) annual meeting"
    },
    {
        "date": "10/2023",
        "text": "I was accepted to the ASIS&T Doctoral Colloquium in London—it was great meeting so many other cool doctoral researchers!"
    },
    {
        "date": "06/2023",
        "text": "I presented at the AERI (Archival Education and Research Institute) 2023 meeting at LSU"
    },
    {
        "date": "02/2023",
        "text": "Our paper 'Recordkeeping, logistics, and translation: a study of homeless services systems as infrastructure' was published in Archival Science!"
    },
    {
        "date": "12/2022",
        "text": "I presented a paper at the 4S (Society for the Social Studies of Science) annual meeting in Cholula, Mexico! I was on an excellent panel 'Social Care', chaired by Cian O'Donovan."
    },
    {
        "date": "10/2022",
        "text": "I participated in the Algorithmic Reparation Workshop organized by Dr. Apryl Williams and Dr. Jenny Davis. It was fantastic!"
    },
    {
        "date": "10/2022",
        "text": "Dr. Garcia and I have been selected for a Google Award for Inclusion Research grant, supporting my ongoing dissertation research!"
    },
    {
        "date": "09/2022",
        "text": "I passed my field prelims and am now a candidate!"
    }, 
    {
        "date": "04/2022",
        "text": "I've been accepted as a 2022 LEADING fellow! I'll be working with Dr. Synatra Smith at Temple University's Scholars Studio"
    },
    {
        "date": "11/2021",
        "text": "Alexandria Rayburn and I presented our research on social workers' use of Reddit at ASIST 2021"
    },
    {
        "date": "09/2021",
        "text": "I chaired the panel 'Theorizing Care and the Digital' at SLSA 2021, and presented on my ongoing research into the infrastructures of homeless services"
    },
    {
        "date": "07/2021",
        "text": "I'm excited to join the Center for Ethics, Society, and Computing as an affiliate researcher"
    }
    
]
